---
kind: method
id: M:Autodesk.Revit.UI.TemporaryGraphicsCommandData.Dispose
source: html/dcc65cac-ae48-0203-ba0f-8cbb6c8abc3c.htm
---
# Autodesk.Revit.UI.TemporaryGraphicsCommandData.Dispose Method

Releases all resources used by the TemporaryGraphicsCommandData

## Syntax (C#)
```csharp
public void Dispose()
```